{
  "data": {
    "repository": {
      "discussion": {
        "number": 995,
        "title": "question about how to avoid overfitting",
        "body": "The equations , generated by Symbolic Regression model, perform well on in sample dataset and have r-square about 0.1 . But they perform bad on out sample dataset. Is there any way that I could improve the generalization of the model. Currently, I have 2 ideas:\r\n\r\n1.  add validation dataset in loss function and evaluate performance based on both train and valid dataset. (if possible)\r\n2.  adjust model parameter. For example, add early stop or lower max-depth, etc..\r\n\r\nIf anyone have any good ideas on improvement of model's generalization, please give me some hints please. Thank you.",
        "comments": {
          "nodes": [
            {
              "author": {
                "login": "gm89uk"
              },
              "body": "Going for simpler equations with good fit goes a long way. I added a small parsimony to my search to encourage this (around a 10th of the lowest expected loss of the most complex equation). I found that unless you have specific domain knowledge and justification for complex operators, they tend to over fit and sticking to more simple operators generalise better.",
              "createdAt": "2025-07-24T09:29:18Z"
            },
            {
              "author": {
                "login": "qizzhao"
              },
              "body": "Hi, thanks for the reply. I am now looking if we could consider the evaluation/performance of validation dataset during the training rather than after training.  For example,  in each iteration/epoch,  we could use train dataset to fit the model,  then we test performance on validation dataset. If the loss of validation dataset decrease, go and train next iteration/epoch. If not, stop the training to avoid overfit.\r\n\r\nIs there any ways that I could reproduce this thought? \r\n\r\nThank you",
              "createdAt": "2025-07-25T06:00:53Z"
            }
          ],
          "pageInfo": {
            "hasNextPage": false,
            "endCursor": "Y3Vyc29yOnYyOpK5MjAyNS0wNy0yNVQwODowMDo1MyswMjowMM4A0-B8"
          }
        }
      }
    }
  }
}